/*
Необхідно написати програму яка буде виводити інформацію за умовами при яких число виводитиметься з правильним словом: "рік", "роки" або "років".
Тобто. "29 років" чи "4 роки".

Умови виконання ДЗ

    Рік отримувати через prompt()
    Зробити перевірку що користувач ввів число та це число не є від'ємним
    Не використовувати функції або інші матеріали які ми не вивчали
    Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки.

*/

let age = prompt("Введите ваш возраст:", "");

//1. Проверка на число и что это число не отрицательное
let isNumber = false;
let isPositive = false;
let suffix;

if ((+age) && (age >= 0)) {
    isNumber = true;
    isPositive = true;
} else if ((+age) && (age < 0)) {
    console.log('Введено отрицательное число')
} else {
    console.log ('Введено не число')
}

//2. Вывод на экран текста согласно условию задачи, если было введено положительное число
if (isPositive && isNumber) {
    //Если возраст оканчивается на числа от 11 до 19 включительно (например, 11 лет, 15 лет и т.д.), то используется вариант "лет".
    if (age % 100 >= 11 && age % 100 <= 19) {
        suffix = 'лет';
    } else {
        switch (age % 10) {
            case 1:
                suffix = 'год';
                break;
            case 2:
            case 3:
            case 4:
                suffix = 'года';
                break;
            default:
                suffix = 'лет';
                break;
        }
    }

    console.log(age + " " + suffix);
}
